app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT * FROM "games"

  def show
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def create
    @game = Game.new(params[:game])
    @game.save
    game_json = @game.attributes
    game_json[:seats] = []
    @game.seats.each do |seat|
---
INSERT INTO "games" ("name", "created_at", "updated_at") VALUES(NULL, '2010-12-16 23:16:50', '2010-12-16 23:16:50')
SELECT * FROM "seats" WHERE ("seats".game_id = 7)