app/controllers/seats_controller.rb

  def reserve
    @game = Game.find params[:game_id]
    @user = User.find params[:user_id]
    unless seat = @game.seats.find_by_user_id(@user.id, :include => :user)
      @game.seats.create(:user => @user)
    end
    game_json = @game.attributes
    game_json[:seats] = []
    @game.seats.each do |seat|
---
SELECT * FROM "games" WHERE ("games"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "seats" WHERE ("seats"."user_id" = 1) AND ("seats".game_id = 1) LIMIT 1
INSERT INTO "seats" ("created_at", "updated_at", "user_id", "game_id", "state") VALUES('2010-12-16 01:17:01', '2010-12-16 01:17:01', 2, 1, NULL)
SELECT * FROM "seats" WHERE ("seats".game_id = 1)

  def cancel
    @game = Game.find params[:game_id]
    @user = User.find params[:user_id]
    if seat = @game.seats.find_by_user_id(@user.id, :include => :user)
      seat.destroy
    end
    game_json = @game.attributes
    game_json[:seats] = []
    @game.seats.each do |seat|
---
SELECT * FROM "games" WHERE ("games"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "seats" WHERE ("seats"."user_id" = 1) AND ("seats".game_id = 1) LIMIT 1
DELETE FROM "seats" WHERE "id" = 543
SELECT * FROM "seats" WHERE ("seats".game_id = 1)

  def show
    @seat = Seat.find(params[:id])
---
SELECT * FROM "seats" WHERE ("seats"."id" = 0)