app/controllers/seats_controller.rb

  def reserve
    @game = Game.find params[:game_id]
    @user = User.find params[:user_id]
    if seat = @game.seats.find_by_user_id(@user.id)
      seat.destroy
---
DELETE FROM "seats" WHERE "id" = 1